function [sys] = three_uuv_Ssurface(dx,dxdt)
%这里输入的变量默认为向量，不止一个元素，因此不能直接参与下面的运算，不然会出错A=B。。。
%潜艇操纵性使用

u(1) = dx(1);
u(2) = dx(2);
u(3) = dx(3);
du(1) = dxdt(1);
du(2) =  dxdt(2);
du(3) =  dxdt(3);
%速度高的时候转首快一点，不过总体来说转首超级慢
%sigmoid函数值域小，扩充一个倍数
%耦合问题无法解决
k_f1 = 50;
k_s1 = 0.01;
k_f2 = 50;%增大加速收敛
k_s2 = 0.001;%增大会减小超调，但是操舵过于频繁；适当减小会操舵不频繁，对震荡束手无策
k_f3 = 3;
k_s3 = 0.001;

z(1)=2/(1+exp(-k_f1*u(1)-k_s1*du(1)))-1;%可能分开会比较好，不同机构的参数还是不一样吧
z(2)=2/(1+exp(-k_f2*u(2)-k_s2*du(2)))-1;
z(3)=2/(1+exp(-k_f3*u(3)-k_s3*du(3)))-1;%du/dt可能误差很大，强化du的效果
delta = 35;%35deg舵角范围,符合实际之后收敛快了
F=1e6;%N

% sys(1) = F * z(1);
% sys(2) = delta * z(3);%r
% sys(3) = delta * z(2);%p
sys=[F * z(1),delta * z(3),delta * z(2)];


